<?php

/**
* 状态码
*/

namespace app\library;

class Code{

  // 获取
  static function get($num=''){
    $code = [
      '0'=>'成功',
      '1'=>'非法操作',
      // Token
      '1000'=>'请重新登录',
      // 参数
      '4000'=>'参数错误',
      '4001'=>'无效地址',
      '4002'=>'无权访问该菜单',
      // 用户
      '4010'=>'帐号或密码错误',
      '4011'=>'该用户已被禁用',
      '4012'=>'该用户不允许登录',
      // 数据
      '4020'=>'数据不存在',
      '4021'=>'添加失败',
      '4022'=>'更新失败',
      '4023'=>'删除失败',
      // 文件
      '4030'=>'上传失败',
      // 异常
      '5000'=>'服务异常错误',
    ];
    return $num=='all'?$code:$code[$num];
  }

}